In [1]:
import sys

In [2]:
sys.executable

'/Users/fanggot/anaconda/bin/python'

In [3]:
sys.version

'3.5.3 |Anaconda custom (64-bit)| (default, Mar  6 2017, 12:15:08) \n[GCC 4.2.1 Compatible Apple LLVM 6.0 (clang-600.0.57)]'

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
s = pd.Series([1,2,3,np.nan,5,6])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [9]:
dates = pd.date_range('20180827', periods=6)
dates

DatetimeIndex(['2018-08-27', '2018-08-28', '2018-08-29', '2018-08-30',
               '2018-08-31', '2018-09-01'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['dog','cat','duck','pig'])
df

                 dog       cat      duck       pig
2018-08-27  1.339756 -0.296368 -0.397652 -0.634418
2018-08-28 -0.494766  1.777709 -0.782425 -0.602734
2018-08-29  0.823664 -1.126050 -1.727833  0.978424
2018-08-30  0.480036  0.942681 -1.891933 -0.965544
2018-08-31 -0.070804 -0.651644 -0.313012  0.104989
2018-09-01 -0.045745 -1.073361  1.770486 -0.535581

In [12]:
df.dtypes

dog     float64
cat     float64
duck    float64
pig     float64
dtype: object

In [17]:
df.head(3)

                 dog       cat      duck       pig
2018-08-27  1.339756 -0.296368 -0.397652 -0.634418
2018-08-28 -0.494766  1.777709 -0.782425 -0.602734
2018-08-29  0.823664 -1.126050 -1.727833  0.978424

In [14]:
df.index

DatetimeIndex(['2018-08-27', '2018-08-28', '2018-08-29', '2018-08-30',
               '2018-08-31', '2018-09-01'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['dog', 'cat', 'duck', 'pig'], dtype='object')

In [16]:
df.values

array([[ 1.33975562, -0.29636774, -0.39765226, -0.63441818],
       [-0.49476601,  1.77770915, -0.78242512, -0.60273446],
       [ 0.82366375, -1.12605032, -1.72783349,  0.97842433],
       [ 0.48003633,  0.94268148, -1.89193261, -0.96554363],
       [-0.07080359, -0.65164431, -0.31301235,  0.10498921],
       [-0.04574526, -1.07336102,  1.77048562, -0.53558074]])

In [19]:
df.describe()

            dog       cat      duck       pig
count  6.000000  6.000000  6.000000  6.000000
mean   0.338690 -0.071172 -0.557062 -0.275811
std    0.673414  1.179074  1.319532  0.706655
min   -0.494766 -1.126050 -1.891933 -0.965544
25%   -0.064539 -0.967932 -1.491481 -0.626497
50%    0.217146 -0.474006 -0.590039 -0.569158
75%    0.737757  0.632919 -0.334172 -0.055153
max    1.339756  1.777709  1.770486  0.978424

In [20]:
df.T

      2018-08-27  2018-08-28  2018-08-29  2018-08-30  2018-08-31  2018-09-01
dog     1.339756   -0.494766    0.823664    0.480036   -0.070804   -0.045745
cat    -0.296368    1.777709   -1.126050    0.942681   -0.651644   -1.073361
duck   -0.397652   -0.782425   -1.727833   -1.891933   -0.313012    1.770486
pig    -0.634418   -0.602734    0.978424   -0.965544    0.104989   -0.535581

In [24]:
df.sort_index(ascending=False)

                 dog       cat      duck       pig
2018-09-01 -0.045745 -1.073361  1.770486 -0.535581
2018-08-31 -0.070804 -0.651644 -0.313012  0.104989
2018-08-30  0.480036  0.942681 -1.891933 -0.965544
2018-08-29  0.823664 -1.126050 -1.727833  0.978424
2018-08-28 -0.494766  1.777709 -0.782425 -0.602734
2018-08-27  1.339756 -0.296368 -0.397652 -0.634418

In [25]:
df.sort_values(by = 'duck')

                 dog       cat      duck       pig
2018-08-30  0.480036  0.942681 -1.891933 -0.965544
2018-08-29  0.823664 -1.126050 -1.727833  0.978424
2018-08-28 -0.494766  1.777709 -0.782425 -0.602734
2018-08-27  1.339756 -0.296368 -0.397652 -0.634418
2018-08-31 -0.070804 -0.651644 -0.313012  0.104989
2018-09-01 -0.045745 -1.073361  1.770486 -0.535581

In [26]:
df['cat']

2018-08-27   -0.296368
2018-08-28    1.777709
2018-08-29   -1.126050
2018-08-30    0.942681
2018-08-31   -0.651644
2018-09-01   -1.073361
Freq: D, Name: cat, dtype: float64

In [28]:
df[2:4]

                 dog       cat      duck       pig
2018-08-29  0.823664 -1.126050 -1.727833  0.978424
2018-08-30  0.480036  0.942681 -1.891933 -0.965544

In [29]:
df.loc[dates[0]]

dog     1.339756
cat    -0.296368
duck   -0.397652
pig    -0.634418
Name: 2018-08-27 00:00:00, dtype: float64

In [33]:
df.loc[:,['cat','pig']]

                 cat       pig
2018-08-27 -0.296368 -0.634418
2018-08-28  1.777709 -0.602734
2018-08-29 -1.126050  0.978424
2018-08-30  0.942681 -0.965544
2018-08-31 -0.651644  0.104989
2018-09-01 -1.073361 -0.535581

In [39]:
df.loc['20180828':'20180831',['cat','duck']]

                 cat      duck
2018-08-28  1.777709 -0.782425
2018-08-29 -1.126050 -1.727833
2018-08-30  0.942681 -1.891933
2018-08-31 -0.651644 -0.313012

In [45]:
df.loc['20180830',['cat','duck']]

cat     0.942681
duck   -1.891933
Name: 2018-08-30 00:00:00, dtype: float64

In [47]:
df.loc['20180831','dog']

-0.070803588993668551

In [49]:
df.at[dates[0],'cat']

-0.29636774438628161

In [50]:
df.loc[[dates[0],dates[2]],['cat','duck']]

                 cat      duck
2018-08-27 -0.296368 -0.397652
2018-08-29 -1.126050 -1.727833

In [51]:
df.iloc[3]

dog     0.480036
cat     0.942681
duck   -1.891933
pig    -0.965544
Name: 2018-08-30 00:00:00, dtype: float64

In [52]:
df.iloc[2:4,0:3]

                 dog       cat      duck
2018-08-29  0.823664 -1.126050 -1.727833
2018-08-30  0.480036  0.942681 -1.891933

In [53]:
df.iat[2,2]

-1.7278334890948099

In [54]:
df.iloc[:,[1,3]]

                 cat       pig
2018-08-27 -0.296368 -0.634418
2018-08-28  1.777709 -0.602734
2018-08-29 -1.126050  0.978424
2018-08-30  0.942681 -0.965544
2018-08-31 -0.651644  0.104989
2018-09-01 -1.073361 -0.535581

In [56]:
df[df.pig > 0]

                 dog       cat      duck       pig
2018-08-29  0.823664 -1.126050 -1.727833  0.978424
2018-08-31 -0.070804 -0.651644 -0.313012  0.104989

In [57]:
df[df > 0]

                 dog       cat      duck       pig
2018-08-27  1.339756       NaN       NaN       NaN
2018-08-28       NaN  1.777709       NaN       NaN
2018-08-29  0.823664       NaN       NaN  0.978424
2018-08-30  0.480036  0.942681       NaN       NaN
2018-08-31       NaN       NaN       NaN  0.104989
2018-09-01       NaN       NaN  1.770486       NaN

In [60]:
df2 = df.copy()

In [61]:
df2['E'] = ['one', 'one','two','three','four','three']

In [62]:
df2[df2['E'].isin(['one'])]

                 dog       cat      duck       pig    E
2018-08-27  1.339756 -0.296368 -0.397652 -0.634418  one
2018-08-28 -0.494766  1.777709 -0.782425 -0.602734  one

In [69]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20180827', periods=6))
df['F'] = s1

In [70]:
df

                 dog       cat      duck       pig  F  D
2018-08-27  1.339756  0.000000 -0.397652  0.000000  1  5
2018-08-28 -0.494766  1.777709 -0.782425  0.000000  2  5
2018-08-29  0.823664  0.000000 -1.727833  0.000000  3  5
2018-08-30  0.480036  0.942681 -1.891933 -0.965544  4  5
2018-08-31 -0.070804 -0.651644 -0.313012  0.104989  5  5
2018-09-01 -0.045745 -1.073361  1.770486 -0.535581  6  5

In [71]:
df.at[[dates[0],dates[2]],['cat','pig']] = 0

In [72]:
df.iat[1,3] = 0

In [73]:
df.loc[:,'D'] = np.array([5] * len(df))

In [74]:
df

                 dog       cat      duck       pig  F  D
2018-08-27  1.339756  0.000000 -0.397652  0.000000  1  5
2018-08-28 -0.494766  1.777709 -0.782425  0.000000  2  5
2018-08-29  0.823664  0.000000 -1.727833  0.000000  3  5
2018-08-30  0.480036  0.942681 -1.891933 -0.965544  4  5
2018-08-31 -0.070804 -0.651644 -0.313012  0.104989  5  5
2018-09-01 -0.045745 -1.073361  1.770486 -0.535581  6  5

In [76]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                 dog       cat      duck       pig  F  D
2018-08-27 -1.339756  0.000000 -0.397652  0.000000 -1 -5
2018-08-28 -0.494766 -1.777709 -0.782425  0.000000 -2 -5
2018-08-29 -0.823664  0.000000 -1.727833  0.000000 -3 -5
2018-08-30 -0.480036 -0.942681 -1.891933 -0.965544 -4 -5
2018-08-31 -0.070804 -0.651644 -0.313012 -0.104989 -5 -5
2018-09-01 -0.045745 -1.073361 -1.770486 -0.535581 -6 -5

In [77]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [78]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [79]:
df1

                 dog       cat      duck       pig  F  D    E
2018-08-27  1.339756  0.000000 -0.397652  0.000000  1  5  1.0
2018-08-28 -0.494766  1.777709 -0.782425  0.000000  2  5  1.0
2018-08-29  0.823664  0.000000 -1.727833  0.000000  3  5  NaN
2018-08-30  0.480036  0.942681 -1.891933 -0.965544  4  5  NaN

In [81]:
df1.dropna(how = 'any')

                 dog       cat      duck  pig  F  D    E
2018-08-27  1.339756  0.000000 -0.397652  0.0  1  5  1.0
2018-08-28 -0.494766  1.777709 -0.782425  0.0  2  5  1.0

In [82]:
df1.fillna(value = 3)

                 dog       cat      duck       pig  F  D    E
2018-08-27  1.339756  0.000000 -0.397652  0.000000  1  5  1.0
2018-08-28 -0.494766  1.777709 -0.782425  0.000000  2  5  1.0
2018-08-29  0.823664  0.000000 -1.727833  0.000000  3  5  3.0
2018-08-30  0.480036  0.942681 -1.891933 -0.965544  4  5  3.0

In [84]:
pd.isnull(df1)

              dog    cat   duck    pig      F      D      E
2018-08-27  False  False  False  False  False  False  False
2018-08-28  False  False  False  False  False  False  False
2018-08-29  False  False  False  False  False  False   True
2018-08-30  False  False  False  False  False  False   True

In [85]:
df

                 dog       cat      duck       pig  F  D
2018-08-27  1.339756  0.000000 -0.397652  0.000000  1  5
2018-08-28 -0.494766  1.777709 -0.782425  0.000000  2  5
2018-08-29  0.823664  0.000000 -1.727833  0.000000  3  5
2018-08-30  0.480036  0.942681 -1.891933 -0.965544  4  5
2018-08-31 -0.070804 -0.651644 -0.313012  0.104989  5  5
2018-09-01 -0.045745 -1.073361  1.770486 -0.535581  6  5

In [86]:
df.mean()

dog     0.338690
cat     0.165898
duck   -0.557062
pig    -0.232689
F       3.500000
D       5.000000
dtype: float64

In [87]:
df.mean(1)

2018-08-27    1.157017
2018-08-28    1.250086
2018-08-29    1.182638
2018-08-30    1.260874
2018-08-31    1.511588
2018-09-01    1.852633
Freq: D, dtype: float64

In [88]:
df.describe()

            dog       cat      duck       pig         F    D
count  6.000000  6.000000  6.000000  6.000000  6.000000  6.0
mean   0.338690  0.165898 -0.557062 -0.232689  3.500000  5.0
std    0.673414  1.045037  1.319532  0.425506  1.870829  0.0
min   -0.494766 -1.073361 -1.891933 -0.965544  1.000000  5.0
25%   -0.064539 -0.488733 -1.491481 -0.401686  2.250000  5.0
50%    0.217146  0.000000 -0.590039  0.000000  3.500000  5.0
75%    0.737757  0.707011 -0.334172  0.000000  4.750000  5.0
max    1.339756  1.777709  1.770486  0.104989  6.000000  5.0

In [89]:
df.apply(np.abs)

                 dog       cat      duck       pig    F    D
2018-08-27  1.339756  0.000000  0.397652  0.000000  1.0  5.0
2018-08-28  0.494766  1.777709  0.782425  0.000000  2.0  5.0
2018-08-29  0.823664  0.000000  1.727833  0.000000  3.0  5.0
2018-08-30  0.480036  0.942681  1.891933  0.965544  4.0  5.0
2018-08-31  0.070804  0.651644  0.313012  0.104989  5.0  5.0
2018-09-01  0.045745  1.073361  1.770486  0.535581  6.0  5.0

In [90]:
df.apply(lambda x : np.dot(x,x))

dog       2.955701
cat       5.625642
duck     10.567730
pig       1.230144
F        91.000000
D       150.000000
dtype: float64

In [93]:
df['D'].value_counts()

5    6
Name: D, dtype: int64

In [96]:
pd.concat( [df[2:4],df[5:]])

                 dog       cat      duck       pig  F  D
2018-08-29  0.823664  0.000000 -1.727833  0.000000  3  5
2018-08-30  0.480036  0.942681 -1.891933 -0.965544  4  5
2018-09-01 -0.045745 -1.073361  1.770486 -0.535581  6  5

In [100]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [101]:
right

   key  rval
0  foo     4
1  foo     5

In [102]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [103]:
pd.merge(left, right, how ='inner', on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [104]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [105]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
s = df.iloc[2]

In [106]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.358948 -0.361990  0.506917  0.410050
1  0.225145  0.312909  0.529165 -0.355426
2 -0.129048  0.620283  0.464841  0.950839
3 -0.340990  1.205001 -0.801406 -0.125751
4 -0.297664 -0.824533 -0.844698  0.387599
5  1.456401  0.045491  1.388459 -1.389872
6 -1.872681  0.457356 -1.325372  0.698636
7 -0.391078 -0.825554 -1.017117  0.346297
8 -0.129048  0.620283  0.464841  0.950839

In [111]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'], 
                   'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.036348 -2.365235
1  bar    one  0.525407 -0.519618
2  foo    two -0.766907 -0.842212
3  bar  three -0.689351 -0.155433
4  foo    two  1.129219  0.977129
5  bar    two  0.285987 -1.757074
6  foo    one  1.174707 -0.090843
7  foo  three -0.911884 -0.008839

In [113]:
df.groupby('B').mean()

              C         D
B
one    0.221255 -0.991899
three -0.800617 -0.082136
two    0.216099 -0.540719

In [114]:
df.groupby(['A','B']).mean()

                  C         D
A   B
bar one    0.525407 -0.519618
    three -0.689351 -0.155433
    two    0.285987 -1.757074
foo one    0.069180 -1.228039
    three -0.911884 -0.008839
    two    0.181156  0.067459

In [115]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))

In [117]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.490571 -0.736260
      two     0.291426  0.049924
baz   one     0.048229  0.276628
      two    -1.893353  1.106953

In [129]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [122]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -1.490571
               B   -0.736260
       two     A    0.291426
               B    0.049924
baz    one     A    0.048229
               B    0.276628
       two     A   -1.893353
               B    1.106953
dtype: float64

In [123]:
stacked.unstack()

                     A         B
first second
bar   one    -1.490571 -0.736260
      two     0.291426  0.049924
baz   one     0.048229  0.276628
      two    -1.893353  1.106953

In [127]:
stacked.unstack(1)

second        one       two
first
bar   A -1.490571  0.291426
      B -0.736260  0.049924
baz   A  0.048229 -1.893353
      B  0.276628  1.106953

In [128]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.490571  0.048229
       B -0.736260  0.276628
two    A  0.291426 -1.893353
       B  0.049924  1.106953

In [135]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [137]:
df.pivot_table(values='E',index=['B','C'], columns=['A'])

A           one     three       two
B C
A bar -0.415150 -0.260967       NaN
  foo -0.207730       NaN  0.572926
B bar  0.050887       NaN  1.041110
  foo  0.345675 -1.695480       NaN
C bar -0.928427  0.923856       NaN
  foo -1.331363       NaN -0.729482

In [138]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2012-01-01    23404
Freq: 5T, dtype: int64

In [140]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.722269
2012-02-29   -0.700570
2012-03-31    0.214932
2012-04-30   -0.404505
2012-05-31   -0.862644
Freq: M, dtype: float64

In [142]:
ps = ts.to_period()
ps

2012-01   -0.722269
2012-02   -0.700570
2012-03    0.214932
2012-04   -0.404505
2012-05   -0.862644
Freq: M, dtype: float64

In [145]:
ps.to_timestamp()

2012-01-01   -0.722269
2012-02-01   -0.700570
2012-03-01    0.214932
2012-04-01   -0.404505
2012-05-01   -0.862644
Freq: MS, dtype: float64

In [146]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00   -0.616435
1990-06-01 09:00   -0.229256
1990-09-01 09:00   -1.060944
1990-12-01 09:00    1.111554
1991-03-01 09:00   -1.417261
Freq: H, dtype: float64

In [156]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [157]:
df["grade"] = df["raw_grade"].astype("category")

In [158]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [160]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df.sort_values(by = 'grade')

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [163]:
df['grade'].value_counts()

very good    3
good         2
very bad     1
medium       0
bad          0
Name: grade, dtype: int64

In [165]:
df.groupby(by='grade').size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64